In [1]:
import pandas
pandas.__version__

'1.0.5'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts = pd.Series([10,11,44,55,999,78])
counts

0     10
1     11
2     44
3     55
4    999
5     78
dtype: int64

In [4]:
counts.values

array([ 10,  11,  44,  55, 999,  78], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=6, step=1)

In [6]:
animals = pd.Series([22,44,67,89,40],

   index = ['cat','dog','donkey','fish','cow'])
    
animals

cat       22
dog       44
donkey    67
fish      89
cow       40
dtype: int64

In [7]:
animals['dog']

44

In [8]:
animals.name = 'counts'
animals.index.name = 'animals are best'
animals

animals are best
cat       22
dog       44
donkey    67
fish      89
cow       40
Name: counts, dtype: int64

In [9]:
np.log(animals)

animals are best
cat       3.091042
dog       3.784190
donkey    4.204693
fish      4.488636
cow       3.688879
Name: counts, dtype: float64

In [10]:
animals[animals>50]

animals are best
donkey    67
fish      89
Name: counts, dtype: int64

In [11]:
animals_dict ={'cat':20,'fish':33,'donkey':47}
print(animals_dict)
pd.Series(animals_dict)

{'cat': 20, 'fish': 33, 'donkey': 47}

cat       20
fish      33
donkey    47
dtype: int64

In [40]:
data = {"Province":['AP','AP','SD','SD','EL'],
        "year":[2001,2002,2003,2005,2006],
        "Date":[23,20,13,12,24]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['AP', 'AP', 'SD', 'SD', 'EL'], 'year': [2001, 2002, 2003, 2005, 2006], 'Date': [23, 20, 13, 12, 24]}

  Province  year  Date
0       AP  2001    23
1       AP  2002    20
2       SD  2003    13
3       SD  2005    12
4       EL  2006    24

In [41]:
df = pd.DataFrame(data,columns=["Date","year","Province"])
df

   Date  year Province
0    23  2001       AP
1    20  2002       AP
2    13  2003       SD
3    12  2005       SD
4    24  2006       EL

In [42]:
df['diif'] = df.year/df.Date
df

   Date  year Province        diif
0    23  2001       AP   87.000000
1    20  2002       AP  100.100000
2    13  2003       SD  154.076923
3    12  2005       SD  167.083333
4    24  2006       EL   83.583333

In [43]:
df['newdata'] = pd.Series(range(5),index = [0,1,2,3,4])
df

   Date  year Province        diif  newdata
0    23  2001       AP   87.000000        0
1    20  2002       AP  100.100000        1
2    13  2003       SD  154.076923        2
3    12  2005       SD  167.083333        3
4    24  2006       EL   83.583333        4

In [44]:
df.to_dict()

{'Date': {0: 23, 1: 20, 2: 13, 3: 12, 4: 24},
 'year': {0: 2001, 1: 2002, 2: 2003, 3: 2005, 4: 2006},
 'Province': {0: 'AP', 1: 'AP', 2: 'SD', 3: 'SD', 4: 'EL'},
 'diif': {0: 87.0,
  1: 100.1,
  2: 154.07692307692307,
  3: 167.08333333333334,
  4: 83.58333333333333},
 'newdata': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [45]:
pd.DataFrame(df.to_dict())

   Date  year Province        diif  newdata
0    23  2001       AP   87.000000        0
1    20  2002       AP  100.100000        1
2    13  2003       SD  154.076923        2
3    12  2005       SD  167.083333        3
4    24  2006       EL   83.583333        4

In [18]:
data = [{'a': i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [19]:
pd.DataFrame([{'a':1,'b':3},{'c':4,'d':6}])

     a    b    c    d
0  1.0  3.0  NaN  NaN
1  NaN  NaN  4.0  6.0

In [20]:
df = pd.DataFrame([{'a':1,'b':3},{'c':4,'d':6}])
df = df.to_dict()
df

{'a': {0: 1.0, 1: nan},
 'b': {0: 3.0, 1: nan},
 'c': {0: nan, 1: 4.0},
 'd': {0: nan, 1: 6.0}}

In [21]:
pd.DataFrame(np.random.randint(2,20),
             columns = ['a','b','c'],
             index = ['1','2','3'])

    a   b   c
1  14  14  14
2  14  14  14
3  14  14  14

In [22]:
ind = pd.Index([23,89,67,56])
ind

Int64Index([23, 89, 67, 56], dtype='int64')

In [23]:
ind[1]

89

In [24]:
ind[::]

Int64Index([23, 89, 67, 56], dtype='int64')

In [25]:
ind[2:3:2]

Int64Index([67], dtype='int64')

In [26]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

4 (4,) 1 int64

In [27]:
ind[1] = 9

TypeError: Index does not support mutable operations

In [28]:
rng = np.random.RandomState(20)
ser = pd.Series(rng.randint(0,10,4))
ser

0    3
1    9
2    4
3    6
dtype: int32

In [29]:
dfr = pd.DataFrame(rng.randint(0,10,(5,4)),
                   columns = ['a','b','c','d'])
dfr

   a  b  c  d
0  7  2  0  6
1  8  5  3  0
2  6  6  0  9
3  5  7  5  2
4  6  9  3  3

In [30]:
np.exp(ser)

0      20.085537
1    8103.083928
2      54.598150
3     403.428793
dtype: float64

In [31]:
np.sin(dfr*np.pi/4)

              a         b         c         d
0 -7.071068e-01  1.000000  0.000000 -1.000000
1 -2.449294e-16 -0.707107  0.707107  0.000000
2 -1.000000e+00 -1.000000  0.000000  0.707107
3 -7.071068e-01 -0.707107 -0.707107  1.000000
4 -1.000000e+00  0.707107  0.707107  0.707107

In [32]:
area = pd.Series({"india": 3333003,"us":9990099,"usa":76054},name = 'area')
population = pd.Series({"tan":8800,"eee":7777,"uuu":4505},name = 'population')
print(area)
population

india    3333003
us       9990099
usa        76054
Name: area, dtype: int64

tan    8800
eee    7777
uuu    4505
Name: population, dtype: int64

In [33]:
population/area

eee     NaN
india   NaN
tan     NaN
us      NaN
usa     NaN
uuu     NaN
dtype: float64

In [34]:
area.index|population.index

Index(['eee', 'india', 'tan', 'us', 'usa', 'uuu'], dtype='object')

In [35]:
A = pd.Series([1,4,8],index=[0,1,2,])
B = pd.Series([1,9,5],index =[1,2,3])
print(A)
print(B)
A+B

0    1
1    4
2    8
dtype: int64
1    1
2    9
3    5
dtype: int64

0     NaN
1     5.0
2    17.0
3     NaN
dtype: float64

In [36]:
A.add(B,fill_value = 0)

0     1.0
1     5.0
2    17.0
3     5.0
dtype: float64

In [46]:
df

   Date  year Province        diif  newdata
0    23  2001       AP   87.000000        0
1    20  2002       AP  100.100000        1
2    13  2003       SD  154.076923        2
3    12  2005       SD  167.083333        3
4    24  2006       EL   83.583333        4

In [47]:
df2 = pd.DataFrame({"Province" : ["AD","TG","IT"],"population" : ["2222","6666","8888"]})
df2

  Province population
0       AD       2222
1       TG       6666
2       IT       8888

In [48]:
df.merge(df2)

Empty DataFrame
Columns: [Date, year, Province, diif, newdata, population]
Index: []

In [49]:
df3 = pd.DataFrame({"Province" : ["AD","TG"],"population" : ["12222","66669"]})
df3
df.merge(df3,right_on = 'Province',left_on = 'Province')

Empty DataFrame
Columns: [Date, year, Province, diif, newdata, population]
Index: []

In [50]:
df4 = pd.DataFrame({"Province" : ["AD","TG","IT"],"population" : ["12222","66669","77777"]})
df4
df.merge(df4,how = 'outer')

   Date    year Province        diif  newdata population
0  23.0  2001.0       AP   87.000000      0.0        NaN
1  20.0  2002.0       AP  100.100000      1.0        NaN
2  13.0  2003.0       SD  154.076923      2.0        NaN
3  12.0  2005.0       SD  167.083333      3.0        NaN
4  24.0  2006.0       EL   83.583333      4.0        NaN
5   NaN     NaN       AD         NaN      NaN      12222
6   NaN     NaN       TG         NaN      NaN      66669
7   NaN     NaN       IT         NaN      NaN      77777

In [51]:
df5 = pd.DataFrame({"Province" : ["AD","TG","IT"],"population" : ["1200222","6666009","7777007"]})
df5
df.merge(df5,how = 'outer')

   Date    year Province        diif  newdata population
0  23.0  2001.0       AP   87.000000      0.0        NaN
1  20.0  2002.0       AP  100.100000      1.0        NaN
2  13.0  2003.0       SD  154.076923      2.0        NaN
3  12.0  2005.0       SD  167.083333      3.0        NaN
4  24.0  2006.0       EL   83.583333      4.0        NaN
5   NaN     NaN       AD         NaN      NaN    1200222
6   NaN     NaN       TG         NaN      NaN    6666009
7   NaN     NaN       IT         NaN      NaN    7777007

In [52]:
serie_a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
                    index=['a','b','c','d','e','f'])
serie_b = pd.Series(np.arange(len(serie_a),dtype = np.float64),
                    index = ['f','h','l','m','t','j'])

In [53]:
serie_a

a    NaN
b    2.5
c    NaN
d    3.5
e    4.5
f    NaN
dtype: float64

In [54]:
serie_b

f    0.0
h    1.0
l    2.0
m    3.0
t    4.0
j    5.0
dtype: float64

In [55]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),index=serie_a.index)

a    0.0
b    2.5
c    2.0
d    3.5
e    4.5
f    5.0
dtype: float64

In [56]:
serie_a.combine_first(serie_b)

a    NaN
b    2.5
c    NaN
d    3.5
e    4.5
f    0.0
h    1.0
j    5.0
l    2.0
m    3.0
t    4.0
dtype: float64